class Meigen {
  final String text;
  final String author;

  const Meigen(this.text, this.author);
}

const List<Meigen> meigens = [
  Meigen("余分の大理石が削ぎ落とされるにつれて、彫像は成長する。", "ミケランジェロ・ディ・ロドヴィーコ・ブオナローティ・シモーニ"),
  Meigen("人生は意義ある悲劇だ。それで美しいのだ。生き甲斐がある。", "岡本太郎"),
  Meigen("人間が不幸なのは、自分が幸福であることを知らないからだ。ただそれだけの理由なのだ。", "フョードル・ミハイロヴィチ・ドストエフスキー"),
  Meigen("心を高揚させる勝利もあれば、堕落させる勝利もある。心を打ちひしぐ敗北もあれば、目覚めさせる敗北もある。",
      "アントワーヌ・マリー・ジャン＝バティスト・ロジェ・ド・サン＝テグジュペリ"),
  Meigen("人生は公平ではない。そのことに慣れよう。", "ウィリアム・ヘンリー・\"ビル\"・ゲイツ3世"),
  Meigen("堪え忍べ、働け、祈れ、そして常に希望を持て。これがわたしが全人類に一度に吹き込もうと願っている真理なのです！",
      "フョードル・ミハイロヴィチ・ドストエフスキー"),
  Meigen("人生というものは、思わぬときに道がひらけたり、閉じたりするものだ。", "武者小路実篤"),
  Meigen("現実の人生というのは、大抵の人にとっては、実に長い次善の人生である。つまり、理想と可能性との永遠の妥協である。",
      "バートランド・アーサー・ウィリアム・ラッセル"),
  Meigen("行き詰まるのは重荷を背負っているからではない。背負い方がいけないだけだ。", "レナ・ホーン"),
  Meigen("人は常に前へだけは進めない。引き潮あり、差し潮がある。", "フリードリヒ・ヴィルヘルム・ニーチェ"),
  Meigen("間違いを犯してばかりの人生は、何もしなかった人生よりも、あっぱれであるだけでなく、役に立つ。", "ジョージ・バーナード・ショー"),
  Meigen("人間には不幸か、貧乏か、病気が必要だ。でないと人間はすぐに思い上がる。", "イワン・セルゲーエヴィチ・ツルゲーネフ"),
  Meigen("苦しいときでも、とにかく笑っていろ。笑える余裕、ゆとりがないと判断を間違える。", "藤森正路"),
  Meigen("人生に失敗した人の多くは、諦めたときに自分がどれほど成功に近づいていたか気づかなかった人たちだ。", "トーマス・アルバ・エジソン"),
  Meigen("自分のしたことに人が評価を下す、それは自由ですけれども、それによって、自分が惑わされたくないのです。", "イチロー"),
  Meigen("挫折を経験したことがない者は、何も新しいことに挑戦したことがないということだ。", "アルベルト・アインシュタイン"),
  Meigen("苦難のときに動揺しないこと。これは真に称賛すべき卓越した人物の証拠である。", "ルートヴィヒ・ヴァン・ベートーヴェン"),
  Meigen("不幸というものは、耐える力が弱いと見て取ると、そこに重くのしかかる。", "ウィリアム・シェイクスピア"),
  Meigen("変化とは人生の法則である。過去と現在しか見ない人は、確実に未来を失う。", "ジョン・フィッツジェラルド・\"ジャック\"・ケネディ"),
  Meigen("扉に変わるかもしれないという、勝手な希望にとらわれて、壁を叩き続けてはいけない。", "ガブリエル・ボヌール・「ココ」・シャネル"),
  Meigen("われわれが人生において犯す最大の過ちは、間違いを犯しはしないかと絶えず恐れていることである。", "エルバート・グリーン・ハバード"),
  Meigen("もし、私にユーモアがなければ、これほど長く苦しい戦いには耐えられなかったでしょう。", "モーハンダース・カラムチャンド・ガーンディー"),
  Meigen("人生は自分の思い通りになんかならないと思っている人は、自らが思い通りにならないことを望んでいる人です。", "ジョセフ・マーフィー"),
  Meigen("蝶はモグラではない。でも、そのことを残念がる蝶はいないだろう。", "アルベルト・アインシュタイン"),
  Meigen("自分に何ができるかを知るより、なにができないかを知ることのほうが重要だ。", "ルシル・ボール"),
  Meigen("難しいからやろうとしないのではない。やろうとしないから、難しくなるのだ。", "ルキウス・アンナエウス・セネカ"),
  Meigen(
      "人生は芝居のごとし、上手な役者が乞食になることもあれば、大根役者が殿様になることもある。とかく、あまり人生を重く見ず、捨て身になって何事も一心になすべし。",
      "福澤諭吉"),
  Meigen("人生は生きることが大事である。いつも好奇心を持ち続けることだ。どんな理由があっても決して人生に背を向けてはいけない。",
      "アナ・エレノア・ルーズベルト"),
  Meigen(
      "生きる上で最も偉大な栄光は、決して転ばないことにあるのではない。転ぶ度に起き上がり続けることにある。", "ネルソン・ホリシャシャ・マンデラ"),
  Meigen(
      "何事もゆきづまれば、まず、自分のものの見方を変えることである。案外、人は無意識の中にも一つの見方に執して、他の見方のあることを忘れがちである。",
      "松下幸之助"),
  Meigen("涙とともにパンを食べたものでなければ、人生の味は分からない。", "ヨハン・ヴォルフガング・フォン・ゲーテ"),
  Meigen("第三者の評価を意識した生き方はしたくない。自分が納得した生き方をしたい。", "イチロー"),
  Meigen("ささいなことが私たちの慰めになるのは、ささいなことが私たちの苦しみになるからである。", "ブレーズ・パスカル"),
  Meigen("運命というものは、人をいかなる災難にあわせても、必ず一方の戸口をあけておいて、そこから救いの手を差しのべてくれるものだ。",
      "ミゲル・デ・セルバンテス・サアベドラ"),
  Meigen("われわれは幸福も不幸も大げさに考えすぎている。自分で考えているほど幸福でもないし、かといって決して不幸でもない。",
      "オノレ・ド・バルザック"),
  Meigen("我々の苦悩の中でも最も歓迎できないのは、自分の存在を軽蔑することだ。", "ミシェル（・エイケム）・ド・モンテーニュ"),
  Meigen("我々の苦悩は、とことんまで経験することによってのみ癒される。", "ヴァランタン＝ルイ＝ジョルジュ＝ウジェーヌ＝マルセル・プルースト"),
  Meigen("不快な状況に対峙するなかれ。我慢ならなくとも、受け入れよ。そうするよう心掛ければ、うまくいく。", "ウィリアム・ジェームズ"),
  Meigen("幸福は伝染するものだ。もし幸福になろうと思うなら、幸福な人々の中で生きたまえ。", "スタンダール"),
  Meigen("あなたができると思えばできる。できないと思えばできない。どちらにしてもあなたが思ったことは正しい。", "ヘンリー・フォード"),
  Meigen("自分の生きる人生を愛せ。自分の愛する人生を生きろ。", "ボブ・マーリー"),
  Meigen("人生はロマン。自分は不幸だと悩むのではなく、試練を与えられた物語の主人公だと思えば、人生をエンジョイできる。", "美輪明宏"),
  Meigen("人格は厳しい状況のもとでこそ計られる。", "ネルソン・ホリシャシャ・マンデラ"),
  Meigen("悲しみが来るときは、単騎ではやってこない。かならず軍団で押し寄せる。", "ウィリアム・シェイクスピア"),
  Meigen("人生に失敗がないと、人生を失敗する。", "斎藤茂太"),
  Meigen("運がいい人も、運が悪い人もいない。運がいいと思う人と、運が悪いと思う人がいるだけだ。", "中谷彰宏"),
  Meigen("希望があるとことに人生もある。希望が新しい勇気をもたらし、再び強い気持ちにしてくれる。", "アンネリース・マリー・フランク"),
  Meigen("人生で学んだすべてを私は3語にまとめられる。それは「何があっても人生には続きがある」ということだ。", "ロバート・リー・フロスト"),
  Meigen("「現実を認めたくない」自分がいて、「現実を受け入れろ」という自分もいる。現実を認めなければ、今を生きることができないですから。",
      "本田圭佑"),
  Meigen("逃げた者はもう一度戦える。", "デモステネス"),
  Meigen("さあ、俺も立ち上がるかな　まあ、もう少し坐つてゐよう", "武者小路実篤"),
  Meigen("自分自身を信じてみるだけでいい。きっと、生きる道が見えてくる。", "ヨハン・ヴォルフガング・フォン・ゲーテ"),
  Meigen("一羽のツバメが来ても夏にはならないし、一日で夏になることもない。このように、一日もしくは短い時間で人は幸福にも幸運にもなりはしない。",
      "アリストテレス"),
  Meigen("人生の経験とはそれをバネにして成長するための教訓である。だから、ほんとうにひどい出来事なんてない。", "スザンヌ・サマーズ"),
  Meigen("成熟するためには、遠回りをしなければならない。", "開高健"),
  Meigen("物事に敏感で自分なりの価値判断を持っていることを「細心」といいます。気が小さいことは人生の武器なのです。", "斎藤茂太"),
  Meigen("死ぬ覚悟が出来ていれば、人は自由に生きられる。", "モーハンダース・カラムチャンド・ガーンディー"),
  Meigen("苦しい時も悲しい時も笑っちゃえば、プラスになりますからねー", "syamu_game"),
  Meigen("いやそれはおかしい", "必殺仕事人"),
  Meigen("KCSにいま入部すれば万事解決", "ロギ犬のお部屋"),
  Meigen("今のままではいけないと思います。だからこそ日本は今のままではいけないと思っている。", "小泉進次郎"),
  Meigen("💩", "8u+4"),
  Meigen("夢は願うものでなく叶えるもの 最大の敵は諦めかけてる自分", "大恩師"),
  Meigen("ベストを尽くして駄目だったってことはベストを尽くしたってことさ", "スティーブ・ジョブズ"),
  Meigen("時間をかけたら出来るのは当たり前と言う人は多いが実際に時間をかけられる人は極わずかしかいない", "Orfevre"),
  Meigen("ﾅｽとｼﾒｼﾞのｶﾘｰです。", "スリヤの店員")
];

List<Meigen> shuffledMeigens() {
  var ret = List.of(meigens);
  return ret..shuffle();
}
